# Solve Murder Mystry

Link: https://mystery.knightlab.com/

### Load Libraries

In [74]:
import pandas as pd 
import sqlite3 as sql

In [75]:
### Connect the file
conn = sql.connect("C:/Users/HP/Documents/Prepinsta/Week 5/Dataset/sql-murder-mystery.db")
conn

### how many people are in this database?

In [76]:
query = """ 
SELECT count(*)
FROM person ;
"""
pd.read_sql_query(query,conn)

   count(*)
0     10011

### Select 10 columns from person table

In [77]:
query = """
SELECT * 
FROM person 
LIMIT 10;
"""
pd.read_sql_query(query,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684
5,10027,Antione Godbolt,439509,2431,Zelham Dr,491650087
6,10034,Kyra Buen,920494,1873,Sleigh Dr,332497972
7,10039,Francesco Agundez,278151,736,Buswell Dr,861079251
8,10095,Leslie Thate,729987,2772,Camellia Park Circle,127944356
9,10122,Alva Conkel,779002,116,Diversey Circle,148521773

## Run the SQL Query

### 1.  Retrieve Crime Scene Report:
Task: Run a query to retrieve the crime scene report for the murder that occurred on Jan.15, 2018, in SQL City. Gather all available details from the report.

### ðŸ‘‰ Clues 
- murder 
- jan 15,2018
- SQL City

In [78]:
query = """
SELECT * 
FROM crime_scene_report
WHERE city = 'SQL City'
AND date = 20180115
AND type = 'murder';
"""
pd.read_sql_query(query,conn)

,date,type,description,city
0,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

In [79]:
### As the description isn't clearly visible for this we have to run this query 
pd.set_option('display.max_colwidth',None)
pd.read_sql_query(query,conn)

,date,type,description,city
0,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

### 2. Witness Personal Details:
Task: Check the personal details of witnesses involved in the case. Retrieve their names, addresses, and any other relevant information.
- 2 witnesses
- 1st - The first witness lives at the last house on "Northwestern Dr"
- 2nd - The second witness, named Annabel, lives somewhere on "Franklin Ave"

In [80]:
### First witness 

query = """
SELECT *
FROM person
WHERE address_street_name = "Northwestern Dr" 
ORDER BY address_number DESC
LIMIT 1 ;
"""
pd.read_sql_query(query,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [81]:
### Second wintess 

query = """
SELECT *
FROM person
WHERE address_street_name = "Franklin Ave" 
AND name LIKE '%Annabel%' ;
"""
pd.read_sql_query(query,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

### 3. View Witness Interviews:
Task: Access the recorded interviews of witnesses conducted after the murder. Gather insights into their statements and potential clues.

In [82]:
query = """
SELECT * 
FROM interview 
WHERE person_id in(16371,14887) ;
"""
pd.read_sql_query(query,conn)

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."
1,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

## First witness

### 4. Check Gym Database:
Task: Investigate the gym database using details obtained from the crime scene report and witness interviews. Look for any gym-related information that might be relevant.

- Get Fit Now Gym" bag started with "48Z" gold member 
- car with a plate that included "H42W"
- my gym last week on January the 9th.

In [83]:
query = """
SELECT * 
FROM get_fit_now_check_in
WHERE membership_id LIKE '%48Z%' 
AND check_in_date = 20180109 ;
"""
pd.read_sql_query(query,conn)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

### 5. Check Car Details:
Task: Examine the car details associated with the crime scene. Retrieve information about the vehicles present during the incident.

In [84]:
query = """
SELECT * 
FROM drivers_license
WHERE plate_number LIKE "%H42W%" ;
"""
pd.read_sql_query(query,conn)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

Two male with a plate no. containg H42W

In [85]:
query = """
SELECT *
FROM person as p

"""
pd.read_sql_query(query,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684
...,...,...,...,...,...,...
10006,99936,Luba Benser,274427,680,Carnage Blvd,685095054
10007,99941,Roxana Mckimley,975942,1613,Gate St,512136801
10008,99965,Cherie Zeimantz,287627,3661,The Water Ave,362877324
10009,99982,Allen Cruse,251350,3126,N Jean Dr,348734531
10010,99990,Vance Hunten,830407,3056,Lancefield St,896677562

### 6. Personal Details:
Task: Identify and collect personal details mentioned in the previous query. This includes names, addresses, and any additional details.

In [86]:
query = """
SELECT p.name,p.id,p.address_number,plate_number
FROM person as p 
LEFT JOIN drivers_license as d on d.id = p.license_id 
WHERE p.id in (67318,28819)
and d.plate_number LIKE "%H42W%" ;
"""
pd.read_sql_query(query,conn)

            name     id  address_number plate_number
0  Jeremy Bowers  67318             530       0H42W2

### 7. Membership Status at the Gym:
Task: Determine who is identified in the previous query as a member of the gym. Utilize the gym database to confirm their membership status.

In [87]:
query = """
SELECT *
FROM get_fit_now_member
WHERE membership_status = 'gold'
AND person_id = 67318 ;

"""

pd.read_sql_query(query,conn)

      id  person_id           name  membership_start_date membership_status
0  48Z55      67318  Jeremy Bowers               20160101              gold

### 8. Analyze and Draw Conclusions:
Task: Analyze the collected data, including crime scene reports, witness interviews, gym records, and car details. Draw conclusions or hypotheses based on the information available.

In [88]:
query = """
SELECT *
FROM interview 
WHERE person_id = 67318

"""
pd.read_sql_query(query,conn)

,person_id,transcript
0,67318,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n"

## Clues
- Woman 
- Height around 5'5" (65") or 5'7" (67")
- Red hair
- Drive tesla model 
- Attended SQL Symphony Concert 3 times in Dec 2017

In [89]:
query = """
SELECT p.id,p.name,i.annual_income,d.hair_color,car_make,car_model,f.event_name
FROM person as p 
LEFT JOIN drivers_license as d on p.license_id = d.id
LEFT JOIN income as i on i.ssn = p.ssn
LEFT JOIN facebook_event_checkin as f on f.person_id = p.id
WHERE height BETWEEN 65 AND 67
AND gender = 'female'
AND hair_color = 'red'
AND LOWER(car_make) = 'tesla'
AND car_model = 'Model S'
AND event_name = 'SQL Symphony Concert' AND date BETWEEN '20171201' AND '20171231' ;



"""
pd.read_sql_query(query,conn)

,id,name,annual_income,hair_color,car_make,car_model,event_name
0,99716,Miranda Priestly,310000,red,Tesla,Model S,SQL Symphony Concert
1,99716,Miranda Priestly,310000,red,Tesla,Model S,SQL Symphony Concert
2,99716,Miranda Priestly,310000,red,Tesla,Model S,SQL Symphony Concert

In [93]:
print("Miranda Priestly was the brain behind the murder!")

Miranda Priestly was the brain behind the murder!